Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་ཡང་ངས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འཐབ་པ་ཞི་བར་བྱས་ནས་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: At that time I pacified their conflict and placed them in the four meditative states and the five superknowledges.

source: ད་ལྟར་ཡང་ངས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འཐབ་པ་ཞི་བར་བྱས་ནས། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ། །
en: Now as well I have pacified their conflict and established them in the unsurpassed, supreme welfare of nirvāṇa.

source: དེར་འདི་རྣམས་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས།
en: At that time, having practiced pure conduct all their lives,

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་བློན་པོ་ཆེན་པོ་ཞིག་གྱོད་ཅིག་ལ་བཏགས་ཏེ། ཅི་བདོག་པ་ཕྲོགས་ནས།
en: When the Blessed One was in Śrāvastī, one of King Prasenajit’s high ministers had everything he possessed confiscated on account of a dispute and

source: ཁྲི་མོན་དུ་བཅུག་པ་ལས། དེ་དེར་ཟས་དང་སྐོམ་གྱིས་མནར་ཏེ་ཤིའོ། །
en: was thrown into the dungeon where he suffered from hunger and thirst and died.

source: དེ་ནས་དེས་སྨོན་ལམ་ལོག་པར་བཏབ་ནས།
en: Now he had made very wicked prayers,

source: ཤི་འཕོས་ཏེ་དུས་ལས་འདས་པའི་འོག་ཏུ། གནོད་སྦྱིན་མ་རུངས་པ་ཞིག་ཏུ་སྐྱེས་ནས།
en: and after he died and transmigrated, he took rebirth as a vicious yakṣa.

source: དེས་ཡུལ་ཀོ་ས་ལ་དེ་ཐམས་ཅད་དུ་མི་ནད་བཏང་སྟེ།
en: Then he set a plague upon people all over Kośala,

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ཁ་དག་པར་གྱུར་ནས། ལྟས་མཁན་དག་གིས་སྨྲས་པ།
en: and after a great many had died the soothsayers declared,

source: བློན་པོ་ཆེན་པོ་དེས་འཆི་ཀར་སྨོན་ལམ་ལོག་པར་བཏབ་ནས།
en: “At his death the high minister made very wicked prayers.

source: གནོད་སྦྱིན་མ་རུངས་པར་སྐྱེས་ཏེ།
en: Now he has taken rebirth as a vicious yakṣa.

source: དེས་མི་ནད་འདི་དག་བཏང་ངོ་ཞེས་བྱས་སོ། །
en: It is he who set this plague upon us.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་མང་པོ་དེ་དག་ཅི་བྱ་གཏོལ་མེད་པར་གྱུར་ཏོ། །
en: When the people heard this, they were desperate and did not know what to do.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བསམས་པ།
en: King Prasenajit thought,

source: འདི་ནི་སུས་ཀྱང་འདུལ་བར་མི་ནུས་ཀྱིས།
en: “No one can tame him.

source: ད་འདིའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་གདབ་དགོས་སོ་སྙམ་སྟེ།
en: I shall have to implore the Blessed One right now to do so.”

source: ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once he had taken a seat at one side, King Prasenajit implored the Blessed One,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ནི་ཀླུ་མ་རུངས་པ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་ལ་སོགས་པ་གཞན་དང་གཞན་དག་ཀྱང་བཏུལ།
en: “Lord, the Blessed One has tamed vicious nāgas like Nanda, Upananda , and others besides.

source: གནོད་སྦྱིན་མ་རུངས་པ་འབྲོག་གནས་ལ་སོགས་པ་གཞན་དང་གཞན་དག་ཀྱང་བཏུལ་ན།
en: You have tamed even the vicious yakṣa lord Aṭavika, and others besides.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བའི་སླད་དུ། གནོད་སྦྱིན་མ་རུངས་པ་དེ་གདུལ་བར་གསོལ།
en: How wonderful it would be if, out of compassion, the Blessed One could tame this vicious yakṣa as well.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དེ་རྗེས་སུ་ཡི་རངས་ནས།
en: King Prasenajit then praised this assurance from the Blessed One, rejoiced,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: and took leave of the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱིས། གནོད་སྦྱིན་དེ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་འདབ་ཏུ་བཞག་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་བཏུལ་བའི་ཕྱིར་མེ་ཆེན་པོ་སྤྲུལ་ཏེ།
en: By means of a miracle the Blessed One set the yakṣa down near the garden of Prince Jeta, and to tame him he emanated a great fire.

source: དེའི་ཁོ་ར་ཁོར་ཡུག་ནས་བདག་ཉིད་མེ་ཆེན་པོས་འཁོར་བར་མཐོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ཀྱི་དྲུང་འབའ་ཞིག་ཞི་བར་མཐོང་ངོ་། །
en: The yakṣa saw the great fire surrounding him on every side, and that it was peaceful only at the feet of the Blessed One.

source: དེ་ནས་དེ་འཇིགས་ཤིང་སྐྲག་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་མ་རུངས་པ་དེ་ལ་བཀའ་སྩལ་པ།
en: Afraid for his life, the vicious yakṣa approached the Blessed One, and the Blessed One said to him,

source: བཞིན་བཟངས་ཁྱོད་ཀྱིས་སྔོན་མི་དགེ་བའི་ལས་བྱས་པས། རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བསད་པ་ཡིན་ན།
en: “My friend, you were executed by King Prasenajit for a previous nonvirtuous action.

source: ད་ཡང་ཁྱོད་འདིར་སྐྱེས་ནས་སྐྱེ་བོ་མང་པོ་ཁ་འདོགས་པར་བྱེད་ན།
en: Even now, since taking rebirth here you have killed many.

source: འདི་ནས་ཤི་འཕོས་པའི་འོག་ཏུ་ཁྱོད་ཀྱི་འགྲོ་བ་ནི་གང་ཡིན། སྐྱེ་གནས་ནི་གང་ཡིན།
en: When you die and transmigrate, what will be your next birth?

source: གནོད་སྦྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་ཅི་སྩལ།
en: “Blessed One, what advice can you give me?” the yakṣa beseeched him.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྡིག་པའི་ལས་འདི་ཐོང་ཤིག །
en: “Give up these evil acts,” the Blessed One instructed.

source: གནོད་སྦྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་བཀའ་ཅི་སྩལ་པ་བཞིན་དུ་འཚལ་ལོ། །
en: “I shall do just as the Blessed One says,” said the yakṣa.

source: དེས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་ནས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: He went for refuge, took the fundamental precepts, and swore to the Blessed One,

source: བཙུན་པ་བདག་གིས་སྡིག་པའི་ལས་བཏང་ལགས་ཏེ།
en: “Lord, I have given up evil acts.

source: བཙུན་པ་དེང་སླན་ཅད་མཉན་དུ་ཡོད་པ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་རྣམས་ཀྱི་སྲུང་མ་དང་།
en: From this day forth, Lord, I shall guard and protect all the many inhabitants of Śrāvastī.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་མ་རུངས་པ་དེ་བཏུལ་ནས། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་འཇིགས་པ་མེད་པའི་གནས་སུ་བཀོད་པ་ལ་གཟིགས།
en: “Lord,” the monks requested the Blessed Buddha, “tell us why the Blessed One tamed this vicious yakṣa, thereby granting many freedom from fear.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ངས་གནོད་སྦྱིན་མ་རུངས་པ་འདི་བཏུལ་ནས། སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཇི་ལྟར་འཇིགས་པ་མེད་པའི་གནས་སུ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I tamed this vicious yakṣa, and thereby granted many freedom from fear. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་རྒྱལ་པོ་བྱེད་དེ། དེའི་ཚེ་ཡུལ་ཀ་ཤིར་ཀླུ་གདུག་པ་དུག་མི་བཟད་པ་ཞིག་བྱུང་སྟེ།
en: “Monks, in times gone by, during King Brahmadatta’s reign in the city of Vārāṇasī, a certain poisonous, extraordinarily venomous nāga appeared in Kāśi

source: དེས་གྲོང་ཡང་སྟོངས་པར་བྱེད། ལྗོངས་ཀྱང་སྟོངས་པར་བྱེད་ཅིང་།
en: and emptied both the villages and the countryside.

source: བཱ་རཱ་ཎ་སཱིའི་ཕྱོགས་སུ་ཆས་པ་ལས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཐོས་ནས། དེ་ཐོས་མ་ཐག་ཏུ་འཇིགས་པ་ཆེན་པོ་སྐྱེས་ཏེ།
en: King Brahmadatta heard that he was headed in the direction of Vārāṇasī, and upon hearing this he flushed with terror.

source: དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ་བཏང་ནས།
en: He armed the four divisions of his army and ordered them,

source: ཁྱེད་དེང་ལ་ཀླུ་གདུག་པ་དེ་སོད་ཅིག་ཅེས་བསྒོའོ། །
en: ‘Go, kill the poisonous nāga!’

source: དེ་ནས་དེ་དག་གིས་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ། གསོལ་པ།
en: “But they bowed down at his feet and said,

source: ལྷ་དེ་ནི་དཔུང་གི་ཚོགས་ཀྱིས་དགུམ་པར་མི་ནུས་ཀྱིས།
en: ‘Deva, a host of armies could not slay it.

source: སྔགས་སམ་སྨན་གྱིས་དེ་དགུམ་པར་ནུས་ལགས་སོ། །
en: Mantras and medicine cannot slay it.

source: ཡང་ན་དགེ་བའི་ཚུལ་གྱིས་བཀུར་བའི་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་རྣམས་ཀྱིས་གདུལ་བར་ནུས་ལགས་སོ་ཞེས་གསོལ་ཏོ། །
en: Perhaps the ascetics or brahmins could tame it with their virtuous ways?’

source: དེ་ནས་དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་དེ་ཉིད་ན་གདོལ་པའི་ཁྱེའུ་བྱམས་པའི་རང་བཞིན་ཅན། སྙིང་རྗེ་ཆེ་བ་སེམས་ཅན་ལ་བྱམས་པ་ཞིག་གནས་པ་དེས།
en: “Now at that time there lived in Vārāṇasī a certain young untouchable with a loving nature, great compassion, and a love for beings.

source: སྐྱེ་བོ་མང་པོ་དེ་དག་ཅི་བྱ་གཏོལ་མེད་པར་གྱུར་པ་མཐོང་ནས། མཐོང་མ་ཐག་ཏུ་དེ་སྙིང་རྗེ་སྐྱེས་ནས་དེས་སྐྱེ་བོ་མང་པོ་རྣམས་ལ་སྨྲས་པ།
en: As he saw that the people were confused about what to do, he felt immense compassion for them, and assured them,

source: ཁྱོད་ཅི་བྱ་གཏོལ་མེད་པར་བྱ་མི་དགོས་ཀྱིས། བདག་གིས་ཀླུ་གདུག་པ་དེ་གདུལ་བར་བྱའོ་ཞེས་བྱས་སོ། །
en: ‘There is no need for such desperate uncertainty, for I shall tame this poisonous nāga.’

source: དེ་ནས་དེའི་ཕ་མ་གཉིས་ན་རེ།
en: “To this his parents replied,

source: དེ་ནི་དབུགས་གདུག་པ་ཡིན་ཏེ་ཁྱོད་ཀྱིས་དེ་གདུལ་མི་ནུས་སོ། །
en: ‘Its very breath is poisonous—you will not be able to tame it.’

source: ཁྱེའུ་དེས་སྨྲས་པ། བྱམས་པའི་གོ་ཆ་གྱོན་པ་ལ་དེས་ཅུང་ཟད་ཀྱང་གནོད་པར་བྱེད་མི་ནུས་སོ་ཞེས་བྱས་ནས།
en: “ ‘If I don the armor of love,’ the child said, ‘he cannot harm me in the least.’

source: ཁྱེའུ་དེས་ཕྱོགས་གང་ན་ཀླུ་གདུག་པ་འདུག་པའི་ཕྱོགས་དེར་སོང་ནས་ཀླུ་གདུག་པ་དེས་ཐག་རིང་པོ་ཞིག་ནས་ཁྱེའུ་དེ་མཐོང་ངོ་། །
en: With that the child set out in the direction the poisonous nāga had gone. As the child approached, the wicked snake saw him from a distance,

source: མཐོང་ནས་ཀྱང་ཁྲོས་ནས་ཁྱེའུ་དེ་ལ་དབུགས་བཏང་ངོ་། །
en: and blew his poisonous breath at him in anger.

source: དེ་ནས་ཁྱེའུ་དེས་བྱམས་པ་ལ་སྙོམས་པར་ཞུགས་ནས་བྱམས་པའི་ལྟ་བས་ཀླུ་གདུག་པ་དེ་ལ་བལྟས་ཏེ།
en: “The child centered himself in love, and looked up at the poisonous nāga with love.

source: དེས་བལྟས་མ་ཐག་ཏུ་དུག་མེད་པར་གྱུར་ཏོ། །
en: No sooner had he cast this gaze than the poison disappeared.

source: དེ་ནས་ཁྱེའུ་དེས་ཀླུ་སྦྲུལ་དེ་ལག་པ་གཉིས་ཀྱིས་བླངས་ནས་མི་མི་གནས་པའི་ས་ཕྱོགས་སུ་བཞག་གོ། །
en: Then the boy picked up the nāga-snake in his two hands and set him down in a region where no people lived.

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་དང་། སྐྱེ་བོ་མང་པོ་གཞན་དག་གིས་གདོལ་པའི་ཁྱེའུ་ཆེ་གེ་མོ་ཞིག་གིས་ཀླུ་གདུག་པ་བཏུལ་ལོ་ཞེས་ཐོས་ནས་
en: “King Brahmadatta and the others heard that young untouchable so-and-so had tamed the poisonous nāga.

source: ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་རང་ཉིད་གདོལ་པའི་ཁྱེའུ་དེའི་ཐད་དུ་སོང་ནས་
en: As soon as they heard this, the king himself approached the young untouchable

source: དེས་ཁྱེའུ་དེ་ལ་དམ་པ་སྣ་གཅིག་འདམ་དུ་བཅུག་སྟེ
en: and bid the child request some type of boon as his reward, saying,

source: ཁྱེའུ་ཁྱོད་ལ་དམ་པ་སྣ་གཅིག་བྱིན་ནོ་ཞེས་བྱས་སོ། །
en: ‘I will grant you some type of boon.’

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ། གནས་པར་མཛོད་ཅིག །
en: ‘Take the path of the ten virtuous actions and there remain.

source: ཡུལ་ན་གནས་པའི་མི་རྣམས་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གཟུད་པར་མཛོད་ཅིག་ཅེས་བྱས་སོ། །
en: Then set the people of your country on the path of the ten virtuous actions.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཁྱེའུ་དེ་ལ་ལོངས་སྤྱོད་ཀྱི་བྱིངས་ཆེན་པོ་བྱིན་ནས།
en: “At that, King Brahmadatta heaped material comforts upon him,

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ་འདུག་གོ། །
en: adopted the path of the ten virtuous actions, and there remained

source: ཡུལ་ན་གནས་པའི་མི་རྣམས་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: while also setting the people of his country on the path of the ten virtuous actions.

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་གདོལ་པའི་ཁྱེའུར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: “O monks, what do you think? I am the one who was that young untouchable then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་ཀླུ་གདུག་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། གནོད་སྦྱིན་མ་རུངས་པ་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was the poisonous nāga then is none other than this vicious yakṣa.

source: དེའི་ཚེ་སྐྱེ་བོ་ཕལ་པོ་ཆེར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི། ཡུལ་ཀོ་ས་ལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were all those many people then are now the many inhabitants of Kośala.

source: དེའི་ཚེ་ཡང་ངས་ཀླུ་གདུག་པ་དེ་བཏུལ་ནས། སྐྱེ་བོ་ཕལ་པོ་ཆེ་འཇིགས་པ་མེད་པའི་གནས་སུ་བཀོད་དོ། །
en: At that time I tamed that poisonous nāga, thereby granting many freedom from fear.

source: ད་ལྟར་ཡང་ངས་གནོད་སྦྱིན་མ་རུངས་པ་འདི་བཏུལ་ནས། སྐྱེ་བོ་ཕལ་པོ་ཆེ་འཇིགས་པ་མེད་པའི་གནས་སུ་བཀོད་དོ། །
en: Now as well I have tamed this vicious yakṣa, and thereby granted many freedom from fear.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་དག་ཐམས་ཅད་དགེ་བསྙེན་དུ་གྱུར་ཏེ།
en: “They also went forth in the teaching of the totally and completely awakened Buddha Kāśyapa.

source: ཤི་བི་གཉིས་ཞེས་བྱ་བ་དེ་ལ།
en: Two Stories about King Śibi

source: ཤི་བི་དང་པོ་ནི།
en: The First Story about King Śibi

source: བཅོམ་ལྡན་འདས་གྱད་ཀྱི་ཡུལ་དུ་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ལས། ཆུ་ཀླུང་མཐའ་ལྡན་དང་། གྲོང་ཁྱེར་ཀུ་ཤའི་བར་གྱི་ལམ་ནས་གུད་དུ་བཟུར་ཏེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: As the Blessed One was traveling through the province of Mallā, he stepped off the road that led to the Antavān River and to Kuśinagarī and said to Venerable Ānanda,

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པའི་བླ་གོས་བཞི་བལྟབ་ཏུ་བགྱིས་ཏེ་ཐིང་ཤིག་དང་།
en: “Ānanda, make four folds in the Tathāgata’s upper garment, and lay it out.

source: ངའི་རྒྱབ་མི་བདེ་བ་དེ་རེ་ཞིག་བསྟི་བར་བྱའོ། །
en: I will rest my sore back awhile.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཙུན་པ་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ཏེ།
en: Venerable Ānanda said, “As you please, Lord.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་བཞིན་དུ་མཉན་ནས། བླ་གོས་བཞི་བལྟབ་ཏུ་བྱས་ཏེ། བཏིང་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Heeding the word of the Blessed One, he made four folds in the upper garment, laid it out, and informed the Blessed One,

source: བཙུན་པ་དེ་བཞིན་གཤེགས་པའི་བླ་གོས་བཞི་བལྟབ་ཏུ་བགྱིས་ཏེ་བཏིང་ལགས་ན།
en: “Lord, I have made four folds in the Tathāgata’s upper garment and laid it out.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ད་དེའི་དུས་ལ་བབ་པར་དགོངས་སུ་གསོལ།
en: Blessed One, please know that the time has come.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་གོས་སྣམ་སྦྱར་སྟུག་པོར་བལྟབ་སྟེ་འཕོངས་སུ་བཞག་ནས།
en: The Blessed One, seeing that his Dharma robes and patched raiment had been folded up and set out, sat himself down,

source: སྣང་བའི་འདུ་ཤེས་དང་ལྡན་པ་དང་། དྲན་པ་དང་ལྡན་པ་དང་། ཤེས་བཞིན་དང་ལྡན་པའི་འདུ་ཤེས་ཐུགས་ལ་དགོངས་ཤིང་གློ་གཡས་ཕྱོགས་ཀྱིས་གཟིམས་ཏེ། ཞབས་གཅིག་གི་སྟེང་དུ་གཅིག་བཞག་གོ། །
en: and then mindful, self-possessed, and with clear perception, he lay down on his right side, placing one leg upon the other.

source: འཁོར་འདིར་སོ་སོའི་སྐྱེ་བོའི་དགེ་སློང་ཇི་སྙེད་འདུས་ཤིང་འཚོགས་པ་དེ་དག་ཐམས་ཅད་ཅི་སངས་རྒྱས་ཀྱིས་འདུལ་བ་ཡིན་ནམ། འོན་ཏེ་ཉན་ཐོས་ཀྱིས་འདུལ་བ་ཡིན་ཞིག་གུ་སྙམ་དུ་དགོངས་སོ། །
en: “Of all those ascetics here in the assembly who are ordinary persons, whom might the Buddha tame, and whom might his disciples tame?”

source: འདི་ན་ཁ་ཅིག་ནི་སངས་རྒྱས་ཀྱིས་འདུལ་བར་འགྱུར་རོ། །
en: “There are some here to be tamed by the Buddha,

source: ཁ་ཅིག་ནི་ཉན་ཐོས་ཀྱིས་འདུལ་བར་འགྱུར་སྙམ་དུ་དགོངས་ནས།
en: and some to be tamed by his disciples.”

source: ཀུན་དགའ་བོ་ཁྱོད་བྱང་ཆུབ་ཀྱི་ཕྱོགས་རྣམས་ལས་སྤོབས་པར་གྱིས་ཤིག །དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་འཁོར་ཐམས་ཅད་དུ་སྒྲ་དེས་གང་བར་འགྱུར་བ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་སོ། །
en: “Ānanda, speak with eloquence about the wings of enlightenment,” and performed a miracle so that the sound of his voice carried across the whole assembly.

source: དེ་ནས་དགེ་སློང་མང་པོ་དག་གིས་ཚིག་དེ་ལྟ་བུ་གསུངས་པའི་སྒྲ་ཐོས་ནས། དེ་དག་གིས་བསམས་པ།
en: Many of the monks thus heard the sound of his voice and thought,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་གཏམ་གྱིས་ཤིག་པར་བསྐུལ་བས་ན་
en: “The Blessed One has exhorted Venerable Ānanda to give a discourse on the wings of enlightenment.

source: ད་ནི་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྦྲང་བུའི་སྦྲང་རྩི་བཙིར་བ་བཞིན་དུ་ཆོས་སྙན་ནོ་ཅོག་སྟོན་པར་འགྱུར་སྙམ་སྟེ
en: Now Venerable Ānanda will teach the Dharma that is sweet as honey from the hive.”

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ལ་བསྐོར་ཏེ་འཁོད་དོ། །
en: They approached the Blessed One and upon their arrival sat in a circle around him.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་དགེ་སློང་རྣམས་ལ་སྨྲས་པ།
en: Venerable Ānanda addressed the monks:

source: ཚེ་དང་ལྡན་པ་དག་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་རྟེན་པ་འདོད་ཆགས་དང་བྲལ་བ་ལ་རྟེན་པ་འགོག་པ་ལ་རྟེན་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་ནི། བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་མངོན་པར་ཤེས་པས། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བསྟན་ཏོ་
en: “Venerable Ones! When the Blessed One became a totally and completely awakened buddha he used his perfect knowledge and taught the limbs of enlightenment. Right mindfulness means to commit oneself to solitude, to commit oneself to freedom from attachment, to commit oneself to cessation of the afflictive emotions, and to transform oneself through complete detachment.

source: ཚེ་དང་ལྡན་པ་དག་ཆོས་རྣམ་པར་འབྱེད་པ་དང་། བརྩོན་འགྲུས་དང་། དགའ་བ་དང་། ཤིན་ཏུ་སྦྱངས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་རྟེན་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་རྟེན་པ། འགོག་པ་ལ་རྟེན་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་ནི། བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་མངོན་པར་ཤེས་པས། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བསྟན་ཏོ་ཞེས།
en: “Venerable Ones! When the Blessed One became a totally and completely awakened buddha with perfect knowledge, he taught the limbs of enlightenment. Analysis of phenomena, diligence, joy, mental and physical pliancy, meditative stabilization , and equanimity likewise mean to commit oneself to solitude, to commit oneself to freedom from attachment, to commit oneself to cessation of the afflictive emotions, and to transform oneself through complete detachment.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་འདི་དག་ཉིད་ལས་བརྩམས་ནས་དགེ་སློང་རྣམས་ལ་དེ་ལྟ་བུ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ
en: After Venerable Ānanda had set forth the limbs of enlightenment, he gave the monks the relevant Dharma teaching

source: དེས་ན་ཉན་ཐོས་དང་དགེ་བའི་རྩ་བ་འབྲེལ་པ་གང་ཡིན་པ་དེ་དག་གིས་སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: such that the disciples and those with the right roots of virtue cast away all afflictive emotions and manifested arhatship right where they sat.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའི་གཏམ་གྱི་མཇུག་རྫོགས་པར་ཐུགས་སུ་ཆུད་ནས་བཞུགས་ཏེ། སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་སྐུ་དྲང་པོར་བསྲངས་ཏེ།
en: When the Blessed One understood that Venerable Ānanda had completed his discourse, he sat down cross-legged,

source: དྲན་པ་མངོན་དུ་བཞག་ནས་བཞུགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: with his body straight, and his mind completely recollected, and then asked Venerable Ānanda,

source: ཀུན་དགའ་བོ་ཁྱོད་བརྩོན་འགྲུས་སྟོན་ཏམ།
en: “Ānanda, did you teach diligence?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བརྩོན་འགྲུས་སྟོན་ལགས་སོ། །
en: “Yes, Blessed One,” he replied, “I taught diligence.”

source: བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་བརྩོན་འགྲུས་སྟོན་ཏམ།
en: “Ānanda, did you teach diligence?”

source: གསོལ་པ། བདེ་བར་གཤེགས་པ་བརྩོན་འགྲུས་སྟོན་ལགས་སོ། །
en: “Yes, Sugata, I taught diligence.”

source: བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་བརྩོན་འགྲུས་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགྱུར་རོ་ཞེས་
en: “Ānanda,” the Blessed One declared, “diligence leads to unexcelled, total, and complete enlightenment.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་འདི་དག་ཉིད་ལས་བརྩམས་ནསདེ་ལྟ་བུ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ། དེས་ན་བཅོམ་ལྡན་འདས་དང་དགེ་བའི་རྩ་བ་འབྲེལ་པ་གང་ཡིན་པ་དེ་དག་གིས་སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: After the Blessed One had set forth the wings of enlightenment, he taught the Dharma particularly suited to them such that those connected to the Blessed One and the roots of virtue cast away all afflictive emotions and manifested arhatship, right where they sat.

source: དེ་དག་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས། གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As arhats, free from the attachments of the three realms, their minds regarded gold no differently than filth, and the palms of their hands as like space itself.

source: དེ་ནས་དེའི་ཚེ་དགེ་སློང་ཞིག་གིས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: On that occasion one monk spoke in verse:

source: སྙན་པའི་ཆོས་ནི་གསན་པའི་ཕྱིར། །སྟོན་པ་སྙུན་བཞིན་ཉིད་ཀྱིས་བསྐུལ། །
en: “Monks, the teacher asked to hear The sweet Dharma, as he was ill.

source: ཁྱོད་ལ་བྱང་ཆུབ་ཡན་ལག་རྣམས། །ཡོད་ན་དགེ་སློང་ཁྱོད་ཤོད་ཅིག །
en: Now you have the limbs of enlightenment, So teach it wherever you will!

source: གནས་བརྟན་ཀུན་དགའ་མཁས་ཤིང་གྲགས། །བྱང་བར་གྱུར་པས་ལེགས་ཞེས་གསོལ། །
en: “Elder Ānanda, skilled, respected, And learned, consented to teach.

source: དཔའ་བོ་ཁྱོད་ཀྱི་གསུང་རབ་ལ། །དཀར་བའི་ཆོས་རྣམས་དེ་དག་མངའ། །
en: He is a master of all the pure teachings That you, the hero, have preached.

source: དྲན་དང་རྣམ་འབྱེད་བརྩོན་འགྲུས་དང་། །དགའ་དང་རབ་སྦྱངས་ཏིང་འཛིན་དང་། །བཏང་སྙོམས་འདི་དག་རྡུལ་མེད་པ། །ཁྱོད་ཀྱི་བྱང་ཆུབ་ཡན་ལག་ལགས། །
en: “Mindfulness, analysis, diligence, Joy, pliancy, meditation, And equanimity—these are the pure limbs Of your enlightenment.

source: བྱང་ཆུབ་ཡན་ལག་བཅུད་ཐོས་ནས། །བྱང་ཆུབ་ཡན་ལག་བཅུད་ཀྱང་རྟོགས། །
en: “Told of the heart of the limbs of enlightenment, He realized the heart of the limbs of enlightenment.

source: བཅོམ་ལྡན་སྙུན་ཚབས་ཆེ་བ་ལས། །གནོད་པ་དེ་ལས་ཞི་བར་གྱུར། །
en: The Blessed One thus recovered from his injury, Which was more painful than a severe illness.

source: དམ་ཆོས་རིན་ཆེན་འདི་སྟོན་པའི། །ཆོས་ཀྱི་མངའ་བདག་དེ་ཉིད་ཀྱང་། །དམ་ཆོས་གསན་པར་བཞེད་གྱུར་ན། །གཞན་ལྟ་ཅི་ལྟར་དེ་མི་ཉན། །
en: “If even the Lord of Dharma himself, Who taught this precious, holy Dharma, Asked to hear the holy Dharma, Why should others not listen to him?

source: སྟོབས་བཅུ་མངའ་བས་ཉེ་རྒྱལ་ནི། །དགེ་སློང་རྣམས་ཀྱི་ཤེས་རབ་མཆོག །བསྟན་པ་གང་ཡིན་དེ་ཉིད་ཀྱང་། །ཆོས་མཉན་འདོད་པས་གཟིར་བར་འགྱུར། །
en: “He who has all ten powers Declared Upatiṣya Wisest of monks, but even he Is overcome with desire to hear the Dharma.

source: མདོ་སྡེ་འདུལ་བ་མ་མོ་འཛིན། །
en: “They hold the sūtra, vinaya, and mātṛkā—

source: མཁས་ཤིང་ཚུལ་དང་ཚུལ་མིན་ཤེས། །
en: They’re wise and they see what’s true.

source: དེ་དག་དམ་ཆོས་ཉན་བྱེད་ན། །
en: If they hearken to this holy Dharma,

source: གཞན་ལྟ་ཇི་ལྟར་དེ་མི་ཉན། །
en: Why should others not listen too?

source: མཁས་པ་ཤེས་འདོད་སེམས་བཞག་ནས། །ཆོས་བཞིན་ཉན་པར་བྱེད་པ་ནི། །སངས་རྒྱས་གསུང་རབ་སྐྱོན་མེད་ལ། །དེ་བཞིན་དགའ་བ་ཐོབ་པར་འགྱུར། །
en: “The wise, intent on learning, Who lend their ears as they should, Also take great joy in The Buddha’s flawless teaching.

source: ཡིད་དགའ་ལུས་ཀྱང་ཤིན་ཏུ་སྦྱངས། །བདེ་བ་ཡང་ནི་མྱོང་བར་འགྱུར། །བདེ་བར་གྱུར་ནས་སེམས་ཉིད་ཀྱིས། །ཏིང་འཛིན་ལ་ཡང་རེག་པར་འགྱུར། །
en: “When the mind is glad, and body supple, And all experience is bliss— From out of bliss, your mind can touch The depths of meditation.

source: སེམས་ནི་མཉམ་པར་གཞག་པ་ཡིས། །འདུ་བྱེད་ཡུལ་གྱི་རྣམ་པར་རིག །
en: “With equipoise, the mind knows That all objects are conditioned.

source: སྲིད་པའི་འགྲོ་ལས་སྐྱོ་བར་འགྱུར། །ཆགས་མེད་སེམས་ཀྱིས་གྲོལ་བར་འགྱུར། །
en: It becomes weary of saṃsāric birth. Without attachment, the mind is freed.

source: རྟག་ཏུ་སྲིད་འགྲོ་སྐྱོ་གྱུར་ན། །ལྷ་དང་མི་ལ་ཆགས་པ་མེད། །
en: “Weary of perpetual rebirth in saṃsāra, Not attached to the realm of gods or humans,

source: བུད་ཤིང་མེད་པའི་མེ་བཞིན་དུ། །དགྲ་བཅོམ་རྣམས་ནི་མྱ་ངན་འདའ། །
en: Gone like fire when the fuel is spent The arhats enter nirvāṇa.

source: དམ་ཆོས་མཉན་པའི་ཕན་ཡོན་ནི། །མང་པོ་གཞན་ཡང་རྒྱལ་བས་བསྟན། །
en: “The Conqueror also taught the many Benefits of hearing the holy Dharma.

source: དེ་ཕྱིར་འདི་ནི་ཡོད་སྙམ་དུ། །སྟོན་པའི་བཀའ་ནི་མཉན་པར་བྱ། །
en: Reflecting upon how this is so, Let us listen to our teacher’s word.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ནི་ལེགས་པར་སྨྲས་པ་གསུང་བ་དང་། ལེགས་པར་སྨྲས་པར་བཞེད་པ་ལགས་ཏེ། ལེགས་པར་སྨྲས་པའི་དོན་གྱི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བསྐུལ་བ་མཛད་ནས།
en: “Lord,” the monks requested the Blessed Buddha, “tell us why the Blessed One, who teaches pithy teachings, requested a pithy teaching, and how the Blessed One exhorted Venerable Ānanda for a pithy teaching.

source: བཀུར་སྟི་དང་ལྡན་པས་གསན་ཀྱང་གསན། བཤད་ཀྱང་བཤད་པ་ལ་གཟིགས།
en: We who venerate you are listening with respect. Please tell us why.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ནི་ད་ལྟར་འབའ་ཞིག་ལེགས་པར་སྨྲས་པ་གསུང་བ་དང་། ལེགས་པར་སྨྲས་པ་བཞེད་པ་མ་ཡིན་གྱིས།
en: “Monks,” the Blessed One explained, “just as now the Tathāgata, who teaches pithy teachings, has requested a pithy teaching,
